## ===============================================

## 第4章 母集団と標本

## ===============================================

## =====================================

## 4.3 点推定

## =====================================

# 母平均の点推定を行う
身長 <- c(165.2, 175.9, 161.7, 174.2, 172.1, 163.3, 170.9, 170.6, 168.4, 171.3)
mean(身長)

# 母集団における身長の分散を推定する
var(身長)

## =====================================

## 4.4 推定値がどれくらい当てになるのかを調べる方法

## =====================================

## サイコロの出る目に関する度数分布

set.seed(1) # シードを1に設定
サイコロ6回振る <- ceiling(runif(n = 6, min = 0, max = 6))
table(サイコロ6回振る)

サイコロ600万回振る <- ceiling(runif(n = 6000000, min = 0, max = 6))
table(サイコロ600万回振る)



## 性別の母集団分布

# 性別の母集団分布のグラフを作成する
barplot(c(2 / 3, 1 / 3), names.arg = c("男性", "女性")) 

## 正規分布

curve(dnorm(x, mean = 0, sd = 1), from = -4, to = 4)
curve(dnorm(x, mean = 1, sd = 1), add = TRUE)
curve(dnorm(x, mean = 0, sd = 2), add = TRUE)



## =====================================

## 4.5 標本分布

## =====================================

## 正規母集団から単純無作為抽出を行う

# 平均50、標準偏差10の正規母集団からn=5の標本を無作為に抽出する
rnorm(n = 5, mean = 50, sd = 10)
標本 <- rnorm(n = 5, mean = 50, sd = 10)
hist(標本)

大標本 <- rnorm(n = 10000, mean = 50, sd = 10)
hist(大標本)



## 正規母集団の母平均の推定
標本 <- rnorm(n = 10, mean = 50, sd = 10)
標本 # データの確認

mean(標本)



## 標本分布を求める
標本平均 <- numeric(length = 10000) # 推定値を格納する場所を予約

# 中括弧に囲まれた処理を10000回繰り返す
for(i in 1:10000) {

    # N(50,10^2)からn=10の標本を抽出
    標本 <- rnorm(n = 10, mean = 50, sd = 10)

    # 標本平均を計算する
    標本平均[i] <- mean(標本)
    
}

hist(標本平均)

# 誤差の絶対値が5以下の推定値を確認する
誤差絶対値5以下 <- ifelse(abs(標本平均 - 50) <= 5, 1, 0)
table(誤差絶対値5以下)

# 度数分布とヒストグラムを重ねて表示させる
hist(標本平均, freq = FALSE)
curve(dnorm(x, mean = 50, sd = sqrt(10)), add = TRUE)



## 標準誤差

# 推定値を格納する場所を予約
標本平均 <- numeric(length = 10000)

for (i in 1:10000) {
    
    # N(50,10^2)からn=100の標本を抽出
    標本 <- rnorm(n = 100, mean = 50, sd = 10)

    # 標本平均を計算する
    標本平均[i] <- mean(標本)
}

var(標本平均)



## =====================================

## 4.6 標本以外の標本分布

## =====================================

## 標本分散と不偏分散の標本分布

# 推定値を格納する場所を予約
標本分散 <- numeric(length = 10000)
# 推定値を格納する場所を予約
不偏分散 <- numeric(length = 10000)

for (i in 1:10000) {

    # N(50,10^2)からn=10の標本を抽出
    標本 <- rnorm(n = 10, mean = 50, sd = 10)

    # 標本分散を計算する
    標本分散[i] <- mean((標本 - mean(標本)) ^ 2)

    # 不偏分散を計算する
    不偏分散[i] <- var(標本)
}

mean(標本分散)
mean(不偏分散)

sd(標本分散)
sd(不偏分散)

hist(標本分散, breaks = seq(0, 500, 10))
hist(不偏分散, breaks = seq(0, 500, 10))

標本分散誤差100以上 <- ifelse(標本分散 >= 200, 1, 0)
不偏分散誤差100以上 <- ifelse(不偏分散 >= 200, 1, 0)

table(標本分散誤差100以上)
table(不偏分散誤差100以上)

mean(sqrt(不偏分散))

## 中央値の標本分布

# 推定値を格納する場所を予約
標本平均 <- numeric(length = 10000)
# 推定値を格納する場所を予約
標本中央値 <- numeric(length = 10000)

for (i in 1:10000) {
    
    # N(50,10^2)からn=10の標本を抽出
    標本 <- rnorm(n = 10, mean = 50, sd = 10)

    # 標本平均を計算する
    標本平均[i] <- mean(標本)

    #標本中央値を計算する
    標本中央値[i] <- median(標本)
}

# 推定量の不偏性について検討する
mean(標本平均)
mean(標本中央値)

sd(標本平均)
sd(標本中央値)

