## =====================================

## 3章練習問題

## =====================================

## (1)解答
勉強時間 <- c(1, 3, 10, 12, 6, 3, 8, 4, 1, 5)
定期試験の得点 <- c(20, 40, 100, 80, 50, 50, 70, 50, 10, 60)

plot(勉強時間, 定期試験の得点)

## (2)解答
cor(勉強時間, 定期試験の得点)

## (3)解答
和食派か洋食派か <- c("洋食", "和食", "和食", "洋食", "和食", "洋食", "洋食", "和食", "洋食", "洋食", "和食", "洋食", "和食", "洋食", "和食", "和食", "洋食", "洋食", "和食", "和食")

辛党か甘党か <- c("甘党", "辛党", "甘党", "甘党", "辛党", "辛党", "辛党", "辛党", "甘党", "甘党", "甘党", "甘党", "辛党", "辛党", "甘党", "辛党", "辛党", "甘党", "辛党", "辛党")

table(和食派か洋食派か, 辛党か甘党か)

## (4)解答
和食派か洋食派かゼロイチ <- ifelse(和食派か洋食派か == "洋食", 1, 0)
辛党か甘党かゼロイチ <- ifelse(辛党か甘党か == "甘党", 1, 0)

cor(和食派か洋食派かゼロイチ, 辛党か甘党かゼロイチ)
